!----------------------------------------------------------------------------
!     ExterForce:用户自定义子程序，给出每个参考点上的外力和外力矩
!          哑    元: 
!          引用变量: module_mark
!          调用过程: 
!          异    常: 
!----------------------------------------------------------------------------
!----------------------------------------------------------------------------
!   SUBROUTINE EXTE_FORCE:计算外力,由用户提供
!                         力和力矩在体坐标系中度量
!----------------------------------------------------------------------------	
subroutine ExterForce
	use module_mark
	implicit none

!	mark(1)%f(1)=0.0


end subroutine ExterForce