!----------------------------------------------------------------------------
!   SUBROUTINE SKEW:计算斜方阵
!	                 输入: A=(Ax,Ay,Az)
!                   输出:   [ 0  -Az    Ay ]
!                         B=[ Az   0   -Ax ]
!                           [-Ay  Ax     0 ]
!
!----------------------------------------------------------------------------
SUBROUTINE SKEW(A,B)
	REAL(KIND=8),DIMENSION(3),INTENT(IN)::A
	REAL(KIND=8),DIMENSION(3,3)::B

	B(1,1)=  0.0;   B(1,2)=-A(3);   B(1,3)= A(2)
	B(2,1)= A(3);   B(2,2)=  0.0;   B(2,3)=-A(1)	  
	B(3,1)=-A(2);   B(3,2)= A(1);   B(3,3)=  0.0

END SUBROUTINE SKEW

